# Esercizi su unioni e intersezioni DataFrames con Pandas

2024.11.19 10.57

In [2]:
import pandas as pd
import numpy as np
import random

inner join su key

In [11]:
df1 = pd.DataFrame({
'key': ['A', 'B', 'C'],
'value1': [1, 2, 3]
})

df2 = pd.DataFrame({
'key': ['A', 'B', 'D'],
'value2': [4, 5, 6]
})

In [12]:
df1

  key  value1
0   A       1
1   B       2
2   C       3

In [13]:
df2

  key  value2
0   A       4
1   B       5
2   D       6

In [ ]:
# inner join su key

df_inner_join = pd.merge(df1, df2, on='key')

df_inner_join

  key  value1  value2
0   A       1       4
1   B       2       5

Combina df1 e df2 impilandoli uno sopra l'altro.

In [ ]:

df1 = pd.DataFrame({
'A': ['foo', 'bar'],
'B': [1, 2]
})

df2 = pd.DataFrame({
'A': ['baz', 'qux'],
'B': [3, 4]
})

In [3]:
df1

     A  B
0  foo  1
1  bar  2

In [4]:
df2

     A  B
0  baz  3
1  qux  4

In [ ]:
# combine df1 e df2 uno sopra l'altro

df_combined = pd.concat([df1, df2])

df_combine

     A  B
0  foo  1
1  bar  2
0  baz  3
1  qux  4

Unisci df1 e df2 sulle colonne 'chiave1' e 'chiave2' includendo tutte le righe di df1. Qual è il DataFrame risultante?

In [18]:
df1 = pd.DataFrame({
'chiave1': ['K0', 'K1', 'K2'],
'chiave2': ['K0', 'K1', 'K0'],
'A': ['A0', 'A1', 'A2']
})

df2 = pd.DataFrame({
'chiave1': ['K0', 'K1', 'K3'],
'chiave2': ['K0', 'K0', 'K0'],
'B': ['B0', 'B1', 'B3']
})

In [19]:
df1

  chiave1 chiave2   A
0      K0      K0  A0
1      K1      K1  A1
2      K2      K0  A2

In [20]:
df2

  chiave1 chiave2   B
0      K0      K0  B0
1      K1      K0  B1
2      K3      K0  B3

In [21]:
# unisci df1 e df2 sulle colonne 'chiave1' e 'chiave2' includendo tutte le righe di df1

df_joined = pd.merge(df1, df2, on=['chiave1', 'chiave2'], how='left') 

df_joined

  chiave1 chiave2   A    B
0      K0      K0  A0   B0
1      K1      K1  A1  NaN
2      K2      K0  A2  NaN

Combina df1 e df2 affiancandoli, allineando gli indici.

In [22]:
df1 = pd.DataFrame({
'A': ['A0', 'A1', 'A2'],
'B': ['B0', 'B1', 'B2']
}, index=[0, 1, 2])

df2 = pd.DataFrame({
'C': ['C0', 'C1', 'C2'],
'D': ['D0', 'D1', 'D2']
}, index=[0, 2, 3])

In [23]:
df1

    A   B
0  A0  B0
1  A1  B1
2  A2  B2

In [24]:
df2

    C   D
0  C0  D0
2  C1  D1
3  C2  D2

In [25]:
# combina df1 e df2 affiancandoli, allineando gli indici

df_combined = df1.join(df2, how='outer')

df_combined

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1  NaN  NaN
2   A2   B2   C1   D1
3  NaN  NaN   C2   D2

Unisci prima df1 e df2 includendo solo le chiavi comuni.
Poi, unisci il risultato con df3 includendo tutte le chiavi di df3.

In [26]:
df1 = pd.DataFrame({
'chiave': ['K0', 'K1', 'K2', 'K3'],
'A': ['A0', 'A1', 'A2', 'A3']
})

df2 = pd.DataFrame({
'chiave': ['K0', 'K1', 'K2'],
'B': ['B0', 'B1', 'B2']
})

df3 = pd.DataFrame({
'chiave': ['K1', 'K2', 'K4'],
'C': ['C1', 'C2', 'C4']
})

In [27]:
df1

  chiave   A
0     K0  A0
1     K1  A1
2     K2  A2
3     K3  A3

In [28]:
df2

  chiave   B
0     K0  B0
1     K1  B1
2     K2  B2

In [29]:
df3

  chiave   C
0     K1  C1
1     K2  C2
2     K4  C4

In [30]:
df1_2 = pd.merge(df1, df2, on="chiave", how="inner")

df1_2

  chiave   A   B
0     K0  A0  B0
1     K1  A1  B1
2     K2  A2  B2

In [32]:
df_final = pd.merge(df1_2, df3, on="chiave", how="outer")
df_final

  chiave    A    B    C
0     K0   A0   B0  NaN
1     K1   A1   B1   C1
2     K2   A2   B2   C2
3     K4  NaN  NaN   C4

Riorganizza il DataFrame in modo che ogni categoria diventi una colonna e i valori siano distribuiti di conseguenza per ogni data.

In [41]:
data = {
'Data': ['2024-01', '2024-01', '2024-02', '2024-02'],
'Categoria': ['A', 'B', 'A', 'B'],
'Valore': [10, 20, 15, 25]
}

df = pd.DataFrame(data)

df

      Data Categoria  Valore
0  2024-01         A      10
1  2024-01         B      20
2  2024-02         A      15
3  2024-02         B      25

In [54]:
# senza pivot
for  i in range(len(df)):
    if df.loc[i, 'Categoria'] == "A":
        df_new.loc[df.loc[i, 'Data'], 'A'] = df.loc[i, 'Valore']        
    elif df.loc[i, 'Categoria'] == "B":
        df_new.loc[df.loc[i, 'Data'], 'B'] = df.loc[i, 'Valore'] 

df_new

Categoria   A   B
Data
2024-01    10  20
2024-02    15  25

In [ ]:

# with pivot

df_new = df.pivot(index='Data', columns='Categoria', values='Valore')

df_new

Categoria   A   B
Data
2024-01    10  20
2024-02    15  25

Crea una tabella pivot che mostri la somma delle vendite per ogni venditore e mese.

In [57]:
data = {
'Venditore': ['Alice', 'Bob', 'Alice', 'Bob', 'Charlie'],
'Mese': ['Gennaio', 'Gennaio', 'Febbraio', 'Febbraio', 'Gennaio'],
'Vendite': [200, 150, 300, 250, 100]
}

df = pd.DataFrame(data)

df

  Venditore      Mese  Vendite
0     Alice   Gennaio      200
1       Bob   Gennaio      150
2     Alice  Febbraio      300
3       Bob  Febbraio      250
4   Charlie   Gennaio      100

In [ ]:
# crea una tabella pivot che mostri la somma delle vendite per ogni venditore e mese

df_pivot = df.pivot(index='Venditore', columns='Mese', values='Vendite')

df_pivot

C:\Users\Utente\AppData\Local\Temp\ipykernel_11656\2439923990.py:3: FutureWarning: The provided callable <function sum at 0x0000020749BE7F60> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  df_pivot = df.pivot_table(index='Venditore', columns='Mese', values='Vendite', aggfunc=np.sum)

Mese       Febbraio  Gennaio
Venditore
Alice         300.0    200.0
Bob           250.0    150.0
Charlie         NaN    100.0

mostrare la media delle vendite di ogni combinazione di Regione e Prodotto

In [3]:
data = {
'Regione': ['Nord', 'Sud', 'Nord', 'Est', 'Ovest', 'Sud', 'Est', 'Ovest'],
'Prodotto': ['A', 'A', 'B', 'B', 'A', 'B', 'A', 'B'],
'Vendite': [100, 150, 200, 250, 300, 350, 400, 450]
}

df = pd.DataFrame(data)

df

  Regione Prodotto  Vendite
0    Nord        A      100
1     Sud        A      150
2    Nord        B      200
3     Est        B      250
4   Ovest        A      300
5     Sud        B      350
6     Est        A      400
7   Ovest        B      450

In [ ]:
# show average of "vendite" for each combination of "Regione" and "Prodotto"